app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "friends", "numpics", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Anuv"], ["friends", 0], ["numpics", 0], ["password", "passwordword"], ["created_at", "2017-04-18 15:01:51.381517"], ["updated_at", "2017-04-18 15:01:51.381517"]]
---
  def create_new_user
    User.create(:name => params[:name], :friends => 0, :numpics => 0, :password => params[:password], :listoffriends => [])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
---
  def get_user
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]
SELECT COUNT(*) FROM "users"
---
  def destroy_user
    user = User.find(params[:id])
    user.destroy

    render json: {Size: User.count}.to_json, :content_type => 'application/json'

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Roberto"], ["updated_at", "2017-04-18 15:28:07.851603"], ["id", 1]]
---
  def update_name
    user = User.find(params[:id])
    user.name = params[:new_name]
    user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 19]]
UPDATE "users" SET "listoffriends" = ?, "friends" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["listoffriends", "[]friend_id"], ["friends", 1], ["updated_at", "2017-04-18 20:57:05.774876"], ["id", 24]]
---
  def add_friend
    user = User.find(params[:user_id])

    checkExisting = user.listoffriends.find(params[:friend_id])

    if checkExisting == nil
      user.friends = user.friends + 1
      user.listoffriends << params[:friend_id].to_s

      user.save